sauloverissimo/ESP32_Host_MIDI/src/MIDIHandler.cpp
#include <Arduino.h>
#include "MIDIHandler.h"
MIDIHandler midiHandler;

#include <algorithm>
#include <cstdio>
#include <sstream>

#if ESP32_HOST_MIDI_HAS_PSRAM
  #include "esp_heap_caps.h"
#endif

MIDIHandler::MIDIHandler()
  : maxEvents(20),
    globalIndex(0),
    nextMsgIndex(1),
    lastTimestamp(0),
    lastNoteOnTimestamp(0),
    nextChordIndex(1),
    currentChordIndex(0),
    historyQueue(nullptr),
    historyQueueCapacity(0),
    historyQueueSize(0),
    historyQueueHead(0),
    transportCount(0)
{
  memset(transports, 0, sizeof(transports));
}

MIDIHandler::~MIDIHandler() {
  if (historyQueue) {
    // Call destructor on each element to properly release std::string
    for (int i = 0; i < historyQueueCapacity; i++) {
      historyQueue[i].~MIDIEventData();
    }
    free(historyQueue);
    historyQueue = nullptr;
  }
}

void MIDIHandler::begin() {
  MIDIHandlerConfig defaultConfig;
  begin(defaultConfig);
}

void MIDIHandler::begin(const MIDIHandlerConfig& cfg) {
  this->config = cfg;
  this->maxEvents = cfg.maxEvents;

#if ESP32_HOST_MIDI_HAS_USB && !defined(ESP32_HOST_MIDI_NO_USB_HOST)
  registerTransport(&usbTransport);
  usbTransport.begin();
#endif

#if ESP32_HOST_MIDI_HAS_BLE
  registerTransport(&bleTransport);
  bleTransport.begin(std::string(cfg.bleName));
#endif

  if (cfg.historyCapacity > 0) {
    enableHistory(cfg.historyCapacity);
  }
}

void MIDIHandler::task() {
  for (int i = 0; i < transportCount; i++) {
    transports[i]->task();
  }
}

// --- Transport Abstraction ---

void MIDIHandler::_onTransportMidiData(void* ctx, const uint8_t* data, size_t len) {
  auto* tctx = static_cast<TransportCallbackContext*>(ctx);
  tctx->handler->handleMidiMessage(data, len);
  tctx->handler->forwardToOtherTransports(tctx->transport, data, len);
}

void MIDIHandler::_onTransportDisconnected(void* ctx) {
  static_cast<MIDIHandler*>(ctx)->clearActiveNotesNow();
}

void MIDIHandler::registerTransport(MIDITransport* t) {
  if (transportCount >= MAX_TRANSPORTS) return;
  int idx = transportCount;
  _transportCtx[idx] = { this, t };
  t->setMidiCallback(_onTransportMidiData, &_transportCtx[idx]);
  t->setSysExCallback(_onTransportSysExData, this);
  t->setConnectionCallbacks(nullptr, _onTransportDisconnected, this);
  transports[transportCount++] = t;
}

void MIDIHandler::addTransport(MIDITransport* transport) {
  registerTransport(transport);
}

void MIDIHandler::removeTransport(MIDITransport* transport) {
  for (int i = 0; i < transportCount; i++) {
    if (transports[i] == transport) {
      // Clear callbacks so detached transport doesn't fire stale pointers
      transport->setMidiCallback(nullptr, nullptr);
      transport->setSysExCallback(nullptr, nullptr);
      transport->setConnectionCallbacks(nullptr, nullptr, nullptr);
      // Shift remaining transports and rebuild callback contexts
      for (int j = i; j < transportCount - 1; j++) {
        transports[j] = transports[j + 1];
        _transportCtx[j] = { this, transports[j] };
        // Re-register callback with updated context pointer
        transports[j]->setMidiCallback(_onTransportMidiData, &_transportCtx[j]);
      }
      transports[--transportCount] = nullptr;
      return;
    }
  }
}

void MIDIHandler::enableHistory(int capacity) {
  if (capacity <= 0) {
    // Disable history, freeing allocated memory
    if (historyQueue) {
      free(historyQueue);
      historyQueue = nullptr;
    }
    historyQueueCapacity = 0;
    historyQueueSize = 0;
    historyQueueHead = 0;
    Serial.println("MIDI history disabled!");
    return;
  }

  // Free existing history before reallocating
  if (historyQueue) {
    free(historyQueue);
    historyQueue = nullptr;
  }

  // Allocate history buffer — prefer PSRAM if available, fall back to heap
#if ESP32_HOST_MIDI_HAS_PSRAM
  historyQueue = static_cast<MIDIEventData*>(heap_caps_malloc(capacity * sizeof(MIDIEventData), MALLOC_CAP_SPIRAM));
#else
  historyQueue = static_cast<MIDIEventData*>(malloc(capacity * sizeof(MIDIEventData)));
#endif

  if (!historyQueue) {
    Serial.println("Failed to allocate memory for history buffer!");
    historyQueueCapacity = 0;
    return;
  }

  historyQueueCapacity = capacity;
  historyQueueSize = 0;
  historyQueueHead = 0;

  // Initialize each object using placement new to avoid std::string issues
  for (int i = 0; i < historyQueueCapacity; i++) {
    new (&historyQueue[i]) MIDIEventData();
  }

  Serial.println("MIDI history enabled!");
}


void MIDIHandler::setQueueLimit(int maxEvents) {
  this->maxEvents = maxEvents;
}

const std::deque<MIDIEventData>& MIDIHandler::getQueue() const {
  return eventQueue;
}

// Expands the dynamic ring buffer.
void MIDIHandler::expandHistoryQueue() {
  int newCapacity = (historyQueueCapacity > 0) ? (historyQueueCapacity * 2) : 10;

#if ESP32_HOST_MIDI_HAS_PSRAM
  MIDIEventData* newQueue = static_cast<MIDIEventData*>(heap_caps_malloc(newCapacity * sizeof(MIDIEventData), MALLOC_CAP_SPIRAM));
#else
  MIDIEventData* newQueue = static_cast<MIDIEventData*>(malloc(newCapacity * sizeof(MIDIEventData)));
#endif

  if (!newQueue) {
    Serial.println("Failed to expand MIDI history buffer!");
    return;
  }
  // Calculate tail index in the current circular buffer.
  int tail = (historyQueueHead + historyQueueCapacity - historyQueueSize) % historyQueueCapacity;
  // Copy events from old buffer to new, preserving order.
  for (int i = 0; i < historyQueueSize; i++) {
    int index = (tail + i) % historyQueueCapacity;
    newQueue[i] = historyQueue[index];
  }
  // Initialize remaining elements in the new buffer
  for (int i = historyQueueSize; i < newCapacity; i++) {
    new (&newQueue[i]) MIDIEventData();
  }
  free(historyQueue);
  historyQueue = newQueue;
  historyQueueCapacity = newCapacity;
  // After copying, new head is immediately after the last element.
  historyQueueHead = historyQueueSize;
  Serial.printf("MIDI history expanded to %d events!\n", historyQueueCapacity);
}

void MIDIHandler::addEvent(const MIDIEventData& event) {
  // Add event to the main queue (stored in SRAM)
  eventQueue.push_back(event);
  processQueue();

  // If history is active, add event to the dynamic buffer
  if (historyQueue != nullptr && historyQueueCapacity > 0) {
    // If buffer is full, expand to avoid discarding events
    if (historyQueueSize == historyQueueCapacity) {
      expandHistoryQueue();
    }
    historyQueue[historyQueueHead] = event;
    historyQueueHead = (historyQueueHead + 1) % historyQueueCapacity;
    historyQueueSize++;
  }
}


void MIDIHandler::processQueue() {
  while (eventQueue.size() > static_cast<size_t>(maxEvents)) {
    eventQueue.pop_front();
  }
}

