sauloverissimo/ESP32_Host_MIDI/src/MIDIHandler.cpp
std::string MIDIHandler::getNoteName(int note) const {
  static const char* names[12] = { "C", "C#", "D", "D#", "E", "F", "F#", "G", "G#", "A", "A#", "B" };
  return names[note % 12];
}

std::string MIDIHandler::getNoteWithOctave(int note) const {
  int octave = (note / 12) - 1;
  return getNoteName(note) + std::to_string(octave);
}

// --- Static note helpers (zero-allocation, v5.2+) ---

const char* MIDIHandler::noteName(uint8_t noteNumber) {
  static const char* names[12] = { "C", "C#", "D", "D#", "E", "F", "F#", "G", "G#", "A", "A#", "B" };
  return names[noteNumber % 12];
}

int MIDIHandler::noteOctave(uint8_t noteNumber) {
  return static_cast<int>(noteNumber / 12) - 1;
}

const char* MIDIHandler::noteWithOctave(uint8_t noteNumber, char* buf, size_t bufLen) {
  snprintf(buf, bufLen, "%s%d", noteName(noteNumber), noteOctave(noteNumber));
  return buf;
}

const char* MIDIHandler::statusName(MIDIStatus code) {
  switch (code) {
    case MIDI_NOTE_OFF:         return "NoteOff";
    case MIDI_NOTE_ON:          return "NoteOn";
    case MIDI_POLY_PRESSURE:    return "PolyPressure";
    case MIDI_CONTROL_CHANGE:   return "ControlChange";
    case MIDI_PROGRAM_CHANGE:   return "ProgramChange";
    case MIDI_CHANNEL_PRESSURE: return "ChannelPressure";
    case MIDI_PITCH_BEND:       return "PitchBend";
    default:                    return "Unknown";
  }
}

std::string MIDIHandler::getActiveNotes() const {
  std::ostringstream oss;
  oss << "{";

  // Step 1: Create a sorted vector from the active notes map
  std::vector<int> sortedNotes;
  for (const auto& kv : activeNotes) {
    sortedNotes.push_back(kv.first);
  }

  // Step 2: Sort by note number
  std::sort(sortedNotes.begin(), sortedNotes.end());

  // Step 3: Build the formatted string
  bool first = true;
  for (int note : sortedNotes) {
    if (!first) oss << ", ";
    oss << getNoteName(note);
    first = false;
  }

  oss << "}";
  return oss.str();
}

std::vector<std::string> MIDIHandler::getActiveNotesVector() const {
  std::vector<std::string> activeNotesVector;

  // Use std::map for automatic sorting by MIDI note number
  std::map<int, int> sortedActiveNotes(activeNotes.begin(), activeNotes.end());

  for (const auto& kv : sortedActiveNotes) {
    activeNotesVector.push_back(getNoteName(kv.first));
  }

  return activeNotesVector;
}

std::string MIDIHandler::getActiveNotesString() const {
  std::ostringstream oss;
  oss << "{";

  // Use std::map for automatic sorting
  std::map<int, int> sortedActiveNotes(activeNotes.begin(), activeNotes.end());

  bool first = true;
  for (const auto& kv : sortedActiveNotes) {
    if (!first) oss << ", ";
    oss << getNoteName(kv.first) << ", {" << kv.second << "}";
    first = false;
  }

  oss << "}";
  return oss.str();
}


size_t MIDIHandler::getActiveNotesCount() const {
  return activeNotes.size();
}

void MIDIHandler::fillActiveNotes(bool out[128]) const {
  memset(out, 0, 128);
  for (const auto& kv : activeNotes) {
    if (kv.first >= 0 && kv.first < 128)
      out[kv.first] = true;
  }
}

// Clears active notes
void MIDIHandler::clearActiveNotesNow() {
  activeNotes.clear();
  activeMsgIndex.clear();
  currentChordIndex = 0;
}

// Clears the event queue and resets all state
void MIDIHandler::clearQueue() {
  eventQueue.clear();
  clearActiveNotesNow();
  globalIndex = 0;
  nextMsgIndex = 1;
  lastTimestamp = 0;
  lastNoteOnTimestamp = 0;
  nextChordIndex = 1;
}

int MIDIHandler::lastChord(const std::deque<MIDIEventData>& queue) const {
  int maxChord = 0;
  for (const auto& event : queue) {
    if (event.chordIndex > maxChord) {
      maxChord = event.chordIndex;
    }
  }
  return maxChord;
}

std::vector<std::string> MIDIHandler::getChord(int chord, const std::deque<MIDIEventData>& queue, const std::vector<std::string>& fields, bool includeLabels) const {
  std::vector<MIDIEventData> chordEvents;

  // Filter only NoteOn events from the specified chord
  for (const auto& event : queue) {
    if (event.chordIndex == chord && event.status == "NoteOn") {
      chordEvents.push_back(event);
    }
  }

  // Sort events by note number
  std::sort(chordEvents.begin(), chordEvents.end(), [](const MIDIEventData& a, const MIDIEventData& b) {
    return a.note < b.note;
  });

  std::vector<std::string> result;

  // If "all" was requested, return all fields
  if (fields.size() == 1 && fields[0] == "all") {
    for (const auto& event : chordEvents) {
      std::ostringstream oss;
      if (includeLabels) {
        oss << "{index:" << event.index
            << ", msgIndex:" << event.msgIndex
            << ", timestamp:" << event.timestamp
            << ", delay:" << event.delay
            << ", channel:" << event.channel
            << ", status:" << event.status
            << ", note:" << event.note
            << ", noteName:" << event.noteName
            << ", noteOctave:" << event.noteOctave
            << ", velocity:" << event.velocity
            << ", chordIndex:" << event.chordIndex
            << ", pitchBend:" << event.pitchBend << "}";
      } else {
        oss << "{ " << event.index
            << ", " << event.msgIndex
            << ", " << event.timestamp
            << ", " << event.delay
            << ", " << event.channel
            << ", " << event.status
            << ", " << event.note
            << ", " << event.noteName
            << ", " << event.noteOctave
            << ", " << event.velocity
            << ", " << event.chordIndex
            << ", " << event.pitchBend << " }";
      }
      result.push_back(oss.str());
    }
  }
  // If a single field was requested
  else if (fields.size() == 1) {
    std::string field = fields[0];
    for (const auto& event : chordEvents) {
      if (field == "noteName") {
        result.push_back(event.noteName);
      } else if (field == "noteOctave") {
        result.push_back(event.noteOctave);
      } else if (field == "status") {
        result.push_back(event.status);
      } else if (field == "note") {
        result.push_back(std::to_string(event.note));
      } else if (field == "timestamp") {
        result.push_back(std::to_string(event.timestamp));
      } else if (field == "velocity") {
        result.push_back(std::to_string(event.velocity));
      } else if (field == "channel") {
        result.push_back(std::to_string(event.channel));
      } else if (field == "pitchBend") {
        result.push_back(std::to_string(event.pitchBend));
      }
    }
  }
  // If multiple fields were requested
  else {
    for (const auto& event : chordEvents) {
      std::ostringstream oss;
      bool first = true;
      for (const auto& field : fields) {
        if (!first) oss << ", ";
        if (field == "noteName") {
          oss << event.noteName;
        } else if (field == "noteOctave") {
          oss << event.noteOctave;
        } else if (field == "status") {
          oss << event.status;
        } else if (field == "note") {
          oss << event.note;
        } else if (field == "timestamp") {
          oss << event.timestamp;
        } else if (field == "velocity") {
          oss << event.velocity;
        } else if (field == "channel") {
          oss << event.channel;
        } else if (field == "pitchBend") {
          oss << event.pitchBend;
        }
        first = false;
      }
      result.push_back(oss.str());
    }
  }

  return result;
}

std::vector<std::string> MIDIHandler::getAnswer(const std::string& field, bool includeLabels) const {
  return getAnswer(std::vector<std::string>{ field }, includeLabels);
}

std::vector<std::string> MIDIHandler::getAnswer(const std::vector<std::string>& fields, bool includeLabels) const {
  std::vector<std::string> result;
  const std::deque<MIDIEventData>& queue = getQueue();

