sauloverissimo/ESP32_Host_MIDI/src/MIDIHandler.cpp
  if (!queue.empty()) {
    int lastChordIdx = lastChord(queue);
    result = getChord(lastChordIdx, queue, fields, includeLabels);
  }

  return result;
}


void MIDIHandler::handleMidiMessage(const uint8_t* data, size_t length) {
  // USB-MIDI: 4+ bytes (CIN + MIDI), skip first byte.
  // BLE/raw MIDI: 2-3 bytes, use directly.
  const uint8_t* midiData;
  if (length >= 4)      midiData = data + 1;  // USB-MIDI: skip CIN byte
  else if (length >= 2) midiData = data;      // BLE/raw MIDI: status + data
  else return;

  // Debug callback — fire before parsing
  if (rawMidiCb) rawMidiCb(data, length, midiData);

  unsigned long now = millis();

  uint8_t midiStatus = midiData[0] & 0xF0;
  int channel = (midiData[0] & 0x0F) + 1;
  unsigned long diff = (globalIndex == 0) ? 0 : (now - lastTimestamp);
  lastTimestamp = now;

  // Channel messages other than NoteOn/NoteOff
  if (midiStatus == 0xB0) {  // Control Change
    MIDIEventData event;
    event.index = ++globalIndex;
    event.msgIndex = 0;
    event.timestamp = now;
    event.delay = diff;
    event.statusCode = MIDI_CONTROL_CHANGE;
    event.channel0 = midiData[0] & 0x0F;
    event.noteNumber = midiData[1];
    event.velocity7 = midiData[2];
    event.velocity16 = MIDI2Scaler::scale7to16(midiData[2]);
    event.pitchBend14 = 0;
    event.pitchBend32 = 0x80000000;
    event.sourceDevice = 0;
    // Deprecated fields
    event.channel = channel;
    event.status = "ControlChange";
    event.note = midiData[1];        // Controller number
    event.noteName = "";
    event.noteOctave = "";
    event.velocity = midiData[2];    // CC value
    event.chordIndex = currentChordIndex;
    event.pitchBend = 0;
    addEvent(event);
    return;
  }

  if (midiStatus == 0xC0) {  // Program Change
    MIDIEventData event;
    event.index = ++globalIndex;
    event.msgIndex = 0;
    event.timestamp = now;
    event.delay = diff;
    event.statusCode = MIDI_PROGRAM_CHANGE;
    event.channel0 = midiData[0] & 0x0F;
    event.noteNumber = midiData[1];
    event.velocity7 = 0;
    event.velocity16 = 0;
    event.pitchBend14 = 0;
    event.pitchBend32 = 0x80000000;
    event.sourceDevice = 0;
    // Deprecated fields
    event.channel = channel;
    event.status = "ProgramChange";
    event.note = midiData[1];  // Program number
    event.noteName = "";
    event.noteOctave = "";
    event.velocity = 0;
    event.chordIndex = currentChordIndex;
    event.pitchBend = 0;
    addEvent(event);
    return;
  }

  if (midiStatus == 0xD0) {  // Channel Pressure (Aftertouch)
    MIDIEventData event;
    event.index = ++globalIndex;
    event.msgIndex = 0;
    event.timestamp = now;
    event.delay = diff;
    event.statusCode = MIDI_CHANNEL_PRESSURE;
    event.channel0 = midiData[0] & 0x0F;
    event.noteNumber = 0;
    event.velocity7 = midiData[1];
    event.velocity16 = MIDI2Scaler::scale7to16(midiData[1]);
    event.pitchBend14 = 0;
    event.pitchBend32 = 0x80000000;
    event.sourceDevice = 0;
    // Deprecated fields
    event.channel = channel;
    event.status = "ChannelPressure";
    event.note = 0;
    event.noteName = "";
    event.noteOctave = "";
    event.velocity = midiData[1];  // Pressure value
    event.chordIndex = currentChordIndex;
    event.pitchBend = 0;
    addEvent(event);
    return;
  }

  if (midiStatus == 0xE0) {  // Pitch Bend
    int pitchValue = (midiData[1] & 0x7F) | ((midiData[2] & 0x7F) << 7);
    MIDIEventData event;
    event.index = ++globalIndex;
    event.msgIndex = 0;
    event.timestamp = now;
    event.delay = diff;
    event.statusCode = MIDI_PITCH_BEND;
    event.channel0 = midiData[0] & 0x0F;
    event.noteNumber = 0;
    event.velocity7 = 0;
    event.velocity16 = 0;
    event.pitchBend14 = static_cast<uint16_t>(pitchValue);
    event.pitchBend32 = MIDI2Scaler::scale14to32(pitchValue);
    event.sourceDevice = 0;
    // Deprecated fields
    event.channel = channel;
    event.status = "PitchBend";
    event.note = 0;
    event.noteName = "";
    event.noteOctave = "";
    event.velocity = 0;
    event.chordIndex = currentChordIndex;
    event.pitchBend = pitchValue;
    addEvent(event);
    return;
  }

  // NoteOn / NoteOff
  int note = midiData[1];
  int velocity = midiData[2];
  std::string statusType;
  int msgIndex = 0;
  int chordIdx = currentChordIndex;

  if (midiStatus == 0x90) {  // NoteOn
    if (velocity > 0) {
      // Velocity filter: ignore ghost notes below threshold
      if (config.velocityThreshold > 0 && velocity < config.velocityThreshold) {
        return;
      }

      statusType = "NoteOn";
      msgIndex = nextMsgIndex++;

      // Chord detection: determine if this NoteOn starts a new chord
      bool startNewChord = false;
      if (activeNotes.empty()) {
        startNewChord = true;
      } else if (config.chordTimeWindow > 0 && (now - lastNoteOnTimestamp) > config.chordTimeWindow) {
        startNewChord = true;
      }

      if (startNewChord) {
        currentChordIndex = nextChordIndex++;
      }

      lastNoteOnTimestamp = now;
      chordIdx = currentChordIndex;
      activeNotes[note] = currentChordIndex;
      activeMsgIndex[note] = msgIndex;
    } else {  // NoteOn with velocity 0 equals NoteOff
      statusType = "NoteOff";
      auto it = activeNotes.find(note);
      if (it != activeNotes.end()) {
        chordIdx = it->second;
        msgIndex = activeMsgIndex[note];
        activeNotes.erase(it);
        activeMsgIndex.erase(note);
      } else {
        chordIdx = currentChordIndex;
      }
    }
  } else if (midiStatus == 0x80) {  // NoteOff
    statusType = "NoteOff";
    auto it = activeNotes.find(note);
    if (it != activeNotes.end()) {
      chordIdx = it->second;
      msgIndex = activeMsgIndex[note];
      activeNotes.erase(it);
      activeMsgIndex.erase(note);
    } else {
      chordIdx = currentChordIndex;
    }
  } else {
    return;  // Unrecognized MIDI message
  }

  if (activeNotes.empty()) {
    currentChordIndex = 0;
  }

  MIDIEventData event;
  event.index = ++globalIndex;
  event.msgIndex = msgIndex;
  event.timestamp = now;
  event.delay = diff;
  // New spec-compliant fields
  event.statusCode = (midiStatus == 0x90 && velocity > 0) ? MIDI_NOTE_ON : MIDI_NOTE_OFF;
  event.channel0 = midiData[0] & 0x0F;
  event.noteNumber = static_cast<uint8_t>(note);
  event.velocity7 = static_cast<uint8_t>(velocity);
  event.velocity16 = MIDI2Scaler::scale7to16(velocity);
  event.pitchBend14 = 0;
  event.pitchBend32 = 0x80000000;
  event.sourceDevice = 0;
  // Deprecated fields
  event.channel = channel;
  event.status = statusType;
  event.note = note;
  event.noteName = getNoteName(note);
  event.noteOctave = getNoteWithOctave(note);
  event.velocity = velocity;
  event.chordIndex = chordIdx;
  event.pitchBend = 0;

  addEvent(event);
}

// --- Inter-device forwarding ---

void MIDIHandler::forwardToOtherTransports(MIDITransport* source, const uint8_t* data, size_t len) {
  // Extract MIDI bytes (same logic as handleMidiMessage)
  const uint8_t* midiData;
  size_t midiLen;
  if (len >= 4) {
    midiData = data + 1;  // USB-MIDI: skip CIN byte
    midiLen = 3;
  } else if (len >= 2) {
    midiData = data;      // BLE/raw: use directly
    midiLen = len;
  } else {
    return;
  }

  for (int i = 0; i < transportCount; i++) {
    if (transports[i] != source && transports[i]->isConnected()) {
      transports[i]->sendMidiMessage(midiData, midiLen);
    }
  }
}

// --- MIDI Output (via any transport that supports sending) ---

