sauloverissimo/ESP32_Host_MIDI/src/MIDIHandler.cpp
bool MIDIHandler::sendNoteOn(uint8_t channel, uint8_t note, uint8_t velocity) {
  if (channel == 0 || channel > 16) return false;
  uint8_t data[3] = { (uint8_t)(0x90 | ((channel - 1) & 0x0F)), note, velocity };
  for (int i = 0; i < transportCount; i++) {
    if (transports[i]->sendMidiMessage(data, 3)) return true;
  }
  return false;
}

bool MIDIHandler::sendNoteOff(uint8_t channel, uint8_t note, uint8_t velocity) {
  if (channel == 0 || channel > 16) return false;
  uint8_t data[3] = { (uint8_t)(0x80 | ((channel - 1) & 0x0F)), note, velocity };
  for (int i = 0; i < transportCount; i++) {
    if (transports[i]->sendMidiMessage(data, 3)) return true;
  }
  return false;
}

bool MIDIHandler::sendControlChange(uint8_t channel, uint8_t controller, uint8_t value) {
  if (channel == 0 || channel > 16) return false;
  uint8_t data[3] = { (uint8_t)(0xB0 | ((channel - 1) & 0x0F)), controller, value };
  for (int i = 0; i < transportCount; i++) {
    if (transports[i]->sendMidiMessage(data, 3)) return true;
  }
  return false;
}

bool MIDIHandler::sendProgramChange(uint8_t channel, uint8_t program) {
  if (channel == 0 || channel > 16) return false;
  uint8_t data[2] = { (uint8_t)(0xC0 | ((channel - 1) & 0x0F)), program };
  for (int i = 0; i < transportCount; i++) {
    if (transports[i]->sendMidiMessage(data, 2)) return true;
  }
  return false;
}

bool MIDIHandler::sendPitchBend(uint8_t channel, int value) {
  if (channel == 0 || channel > 16) return false;
  // Normalize -8192..8191 to 0..16383 (center = 8192)
  uint16_t v = (uint16_t)(value + 8192) & 0x3FFF;
  uint8_t data[3] = { (uint8_t)(0xE0 | ((channel - 1) & 0x0F)),
                      (uint8_t)(v & 0x7F),
                      (uint8_t)((v >> 7) & 0x7F) };
  for (int i = 0; i < transportCount; i++) {
    if (transports[i]->sendMidiMessage(data, 3)) return true;
  }
  return false;
}

bool MIDIHandler::sendRaw(const uint8_t* data, size_t length) {
  for (int i = 0; i < transportCount; i++) {
    if (transports[i]->sendMidiMessage(data, length)) return true;
  }
  return false;
}

bool MIDIHandler::sendBleRaw(const uint8_t* data, size_t length) {
  return sendRaw(data, length);
}

// --- SysEx ---

void MIDIHandler::_onTransportSysExData(void* ctx, const uint8_t* data, size_t len) {
  static_cast<MIDIHandler*>(ctx)->handleSysExMessage(data, len);
}

void MIDIHandler::handleSysExMessage(const uint8_t* data, size_t length) {
  if (length < 2) return;
  if (config.maxSysExSize == 0) return;

  size_t truncLen = length;
  if (truncLen > static_cast<size_t>(config.maxSysExSize)) {
    truncLen = config.maxSysExSize;
  }

  if (sysExCb) sysExCb(data, truncLen);

  MIDISysExEvent event;
  event.index = ++sysexGlobalIndex;
  event.timestamp = millis();
  event.data.assign(data, data + truncLen);
  sysexQueue.push_back(std::move(event));

  while (sysexQueue.size() > static_cast<size_t>(config.maxSysExEvents)) {
    sysexQueue.pop_front();
  }
}

const std::deque<MIDISysExEvent>& MIDIHandler::getSysExQueue() const {
  return sysexQueue;
}

void MIDIHandler::clearSysExQueue() {
  sysexQueue.clear();
}

bool MIDIHandler::sendSysEx(const uint8_t* data, size_t length) {
  if (length < 2 || data[0] != 0xF0 || data[length - 1] != 0xF7) return false;
  for (int i = 0; i < transportCount; i++) {
    transports[i]->sendMidiMessage(data, length);
  }
  return true;
}

#if ESP32_HOST_MIDI_HAS_BLE
bool MIDIHandler::isBleConnected() const {
  return bleTransport.isConnected();
}
#endif

